# 설탕 배달
# 설탕 배달 18kg을 3kg설탕과 5kg설탕으로 할때
# 3kg 6개를 사용할수도 있지만 5kg 3개 3kg 1개를 사용하여 설탕 개수를 줄일 수 있다.
# 이런식으로 Nkg의 설탕을 배달 할 때, 설탕의 최소 갯수를 구하여라.
# 정확히 Nkg의 배달이 불가능 할때는 -1을 출력한다.

inp = int(input())
Box = 0
while True:
    # 5의 배수일때는 이걸로 한방에 해결 가능
    if (inp % 5) == 0:
        Box = Box + (inp//5)
        print(Box)
        break
    # 5의 배수가 아닐 경우 3씩 빼가면서 5로 나눠 떨어지는 수가 있는지 알아본다
    inp = inp-3
    Box += 1
    # 원래 수가 0미만으로 떨어진다면 5kg과 3kg으로 조합이 불가능하다는 것이므로 -1 출력
    if inp < 0:
        print("-1")
        break