import pandas as pd

df = pd.DataFrame([[1,2,3,4], [4,5,6,7], [7,8,9,10]],
                    columns=list('abcd'), index=('가','나','다'))                  
#판다스는 행 열 우선중에 열이 우선이다.

df2 = df
df2['a'] = 100

print(df)
'''
     a  b  c   d
가  100  2  3   4
나  100  5  6   7
다  100  8  9  10
'''

print(id(df), id(df2))  # 1149788776000 1149788776000

df3 = df.copy()

df2['b'] = 333

print(df)
print(df2)
print(df3)

'''
     a  b  c   d
가  100  2  3   4
나  100  5  6   7
다  100  8  9  10
1661633783360 1661633783360
     a    b  c   d
가  100  333  3   4
나  100  333  6   7
다  100  333  9  10
     a    b  c   d
가  100  333  3   4
나  100  333  6   7
다  100  333  9  10
     a  b  c   d
가  100  2  3   4
나  100  5  6   7
다  100  8  9  10
'''

df = df+99

print(df)
print(df2)
print(df3)

'''
     a    b    c    d
가  199  432  102  103
나  199  432  105  106
다  199  432  108  109
     a    b  c   d
가  100  333  3   4
나  100  333  6   7
다  100  333  9  10
     a  b  c   d
가  100  2  3   4
나  100  5  6   7
다  100  8  9  10
'''